khgaurav/Atmega/Proteus 8 Professional/SAMPLES/VSM for Cortex M3/Stellaris/adc_oversampling/inc/hw_usb.h
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE4 register.
//
//*****************************************************************************
#define USB_TXTYPE4_SPEED_M     0x000000C0  // Operating Speed.
#define USB_TXTYPE4_SPEED_DFLT  0x00000000  // Default
#define USB_TXTYPE4_SPEED_FULL  0x00000080  // Full
#define USB_TXTYPE4_SPEED_LOW   0x000000C0  // Low
#define USB_TXTYPE4_PROTO_M     0x00000030  // Protocol.
#define USB_TXTYPE4_PROTO_CTRL  0x00000000  // Control
#define USB_TXTYPE4_PROTO_ISOC  0x00000010  // Isochronous
#define USB_TXTYPE4_PROTO_BULK  0x00000020  // Bulk
#define USB_TXTYPE4_PROTO_INT   0x00000030  // Interrupt
#define USB_TXTYPE4_TEP_M       0x0000000F  // Target Endpoint Number.
#define USB_TXTYPE4_TEP_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL4
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL4_TXPOLL_M \
                                0x000000FF  // TX Polling
#define USB_TXINTERVAL4_NAKLMT_M \
                                0x000000FF  // NAK Limit.
#define USB_TXINTERVAL4_NAKLMT_S \
                                0
#define USB_TXINTERVAL4_TXPOLL_S \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE4 register.
//
//*****************************************************************************
#define USB_RXTYPE4_SPEED_M     0x000000C0  // Operating Speed.
#define USB_RXTYPE4_SPEED_DFLT  0x00000000  // Default
#define USB_RXTYPE4_SPEED_FULL  0x00000080  // Full
#define USB_RXTYPE4_SPEED_LOW   0x000000C0  // Low
#define USB_RXTYPE4_PROTO_M     0x00000030  // Protocol.
#define USB_RXTYPE4_PROTO_CTRL  0x00000000  // Control
#define USB_RXTYPE4_PROTO_ISOC  0x00000010  // Isochronous
#define USB_RXTYPE4_PROTO_BULK  0x00000020  // Bulk
#define USB_RXTYPE4_PROTO_INT   0x00000030  // Interrupt
#define USB_RXTYPE4_TEP_M       0x0000000F  // Target Endpoint Number.
#define USB_RXTYPE4_TEP_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL4
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL4_TXPOLL_M \
                                0x000000FF  // RX Polling
#define USB_RXINTERVAL4_NAKLMT_M \
                                0x000000FF  // NAK Limit.
#define USB_RXINTERVAL4_NAKLMT_S \
                                0
#define USB_RXINTERVAL4_TXPOLL_S \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP5 register.
//
//*****************************************************************************
#define USB_TXMAXP5_MAXLOAD_M   0x000007FF  // Maximum Payload.
#define USB_TXMAXP5_MAXLOAD_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL5 register.
//
//*****************************************************************************
#define USB_TXCSRL5_NAKTO       0x00000080  // NAK Timeout
#define USB_TXCSRL5_INCTX       0x00000080  // Incomplete Transmit.
#define USB_TXCSRL5_CLRDT       0x00000040  // Clear Data Toggle.
#define USB_TXCSRL5_STALLED     0x00000020  // Endpoint Stalled.
#define USB_TXCSRL5_SETUP       0x00000010  // Setup Packet.
#define USB_TXCSRL5_STALL       0x00000010  // Send Stall.
#define USB_TXCSRL5_FLUSH       0x00000008  // Flush FIFO.
#define USB_TXCSRL5_ERROR       0x00000004  // Error.
#define USB_TXCSRL5_UNDRN       0x00000004  // Underrun.
#define USB_TXCSRL5_FIFONE      0x00000002  // FIFO Not Empty.
#define USB_TXCSRL5_TXRDY       0x00000001  // Transmit Packet Ready.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH5 register.
//
//*****************************************************************************
#define USB_TXCSRH5_AUTOSET     0x00000080  // Auto Set.
#define USB_TXCSRH5_ISO         0x00000040  // ISO.
#define USB_TXCSRH5_MODE        0x00000020  // Mode.
#define USB_TXCSRH5_DMAEN       0x00000010  // DMA Request Enable.
#define USB_TXCSRH5_FDT         0x00000008  // Force Data Toggle.
#define USB_TXCSRH5_DMAMOD      0x00000004  // DMA Request Mode.
#define USB_TXCSRH5_DTWE        0x00000002  // Data Toggle Write Enable.
#define USB_TXCSRH5_DT          0x00000001  // Data Toggle.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP5 register.
//
//*****************************************************************************
#define USB_RXMAXP5_MAXLOAD_M   0x000007FF  // Maximum Payload.
#define USB_RXMAXP5_MAXLOAD_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL5 register.
//
//*****************************************************************************
#define USB_RXCSRL5_CLRDT       0x00000080  // Clear Data Toggle.
#define USB_RXCSRL5_STALLED     0x00000040  // Endpoint Stalled.
#define USB_RXCSRL5_STALL       0x00000020  // Send Stall.
#define USB_RXCSRL5_REQPKT      0x00000020  // Request Packet.
#define USB_RXCSRL5_FLUSH       0x00000010  // Flush FIFO.
#define USB_RXCSRL5_NAKTO       0x00000008  // NAK Timeout.
#define USB_RXCSRL5_DATAERR     0x00000008  // Data Error.
#define USB_RXCSRL5_ERROR       0x00000004  // Error.
#define USB_RXCSRL5_OVER        0x00000004  // Overrun.
#define USB_RXCSRL5_FULL        0x00000002  // FIFO Full.
#define USB_RXCSRL5_RXRDY       0x00000001  // Receive Packet Ready.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH5 register.
//
//*****************************************************************************
#define USB_RXCSRH5_AUTOCL      0x00000080  // Auto Clear.
#define USB_RXCSRH5_AUTORQ      0x00000040  // Auto Request.
#define USB_RXCSRH5_ISO         0x00000040  // ISO.
#define USB_RXCSRH5_DMAEN       0x00000020  // DMA Request Enable.
#define USB_RXCSRH5_DISNYET     0x00000010  // Disable NYET
#define USB_RXCSRH5_PIDERR      0x00000010  // PID Error.
#define USB_RXCSRH5_DMAMOD      0x00000008  // DMA Request Mode.
#define USB_RXCSRH5_DTWE        0x00000004  // Data Toggle Write Enable.
#define USB_RXCSRH5_DT          0x00000002  // Data Toggle.
#define USB_RXCSRH5_INCRX       0x00000001  // Incomplete Receive.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT5 register.
//
//*****************************************************************************
#define USB_RXCOUNT5_COUNT_M    0x00001FFF  // Receive Packet Count.
#define USB_RXCOUNT5_COUNT_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE5 register.
//
//*****************************************************************************
#define USB_TXTYPE5_SPEED_M     0x000000C0  // Operating Speed.
#define USB_TXTYPE5_SPEED_DFLT  0x00000000  // Default
#define USB_TXTYPE5_SPEED_FULL  0x00000080  // Full
#define USB_TXTYPE5_SPEED_LOW   0x000000C0  // Low
#define USB_TXTYPE5_PROTO_M     0x00000030  // Protocol.
#define USB_TXTYPE5_PROTO_CTRL  0x00000000  // Control
#define USB_TXTYPE5_PROTO_ISOC  0x00000010  // Isochronous
#define USB_TXTYPE5_PROTO_BULK  0x00000020  // Bulk
#define USB_TXTYPE5_PROTO_INT   0x00000030  // Interrupt
#define USB_TXTYPE5_TEP_M       0x0000000F  // Target Endpoint Number.
#define USB_TXTYPE5_TEP_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL5
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL5_TXPOLL_M \
                                0x000000FF  // TX Polling
#define USB_TXINTERVAL5_NAKLMT_M \
                                0x000000FF  // NAK Limit.
#define USB_TXINTERVAL5_NAKLMT_S \
                                0
#define USB_TXINTERVAL5_TXPOLL_S \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE5 register.
//
//*****************************************************************************
#define USB_RXTYPE5_SPEED_M     0x000000C0  // Operating Speed.
#define USB_RXTYPE5_SPEED_DFLT  0x00000000  // Default
#define USB_RXTYPE5_SPEED_FULL  0x00000080  // Full
#define USB_RXTYPE5_SPEED_LOW   0x000000C0  // Low
#define USB_RXTYPE5_PROTO_M     0x00000030  // Protocol.
#define USB_RXTYPE5_PROTO_CTRL  0x00000000  // Control
#define USB_RXTYPE5_PROTO_ISOC  0x00000010  // Isochronous
#define USB_RXTYPE5_PROTO_BULK  0x00000020  // Bulk
#define USB_RXTYPE5_PROTO_INT   0x00000030  // Interrupt
#define USB_RXTYPE5_TEP_M       0x0000000F  // Target Endpoint Number.
#define USB_RXTYPE5_TEP_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL5
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL5_TXPOLL_M \
                                0x000000FF  // RX Polling
#define USB_RXINTERVAL5_NAKLMT_M \
                                0x000000FF  // NAK Limit.
#define USB_RXINTERVAL5_TXPOLL_S \
                                0
#define USB_RXINTERVAL5_NAKLMT_S \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP6 register.
//
//*****************************************************************************
#define USB_TXMAXP6_MAXLOAD_M   0x000007FF  // Maximum Payload.
#define USB_TXMAXP6_MAXLOAD_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL6 register.
//
//*****************************************************************************
#define USB_TXCSRL6_INCTX       0x00000080  // Incomplete Transmit.
#define USB_TXCSRL6_NAKTO       0x00000080  // NAK Timeout
#define USB_TXCSRL6_CLRDT       0x00000040  // Clear Data Toggle.
#define USB_TXCSRL6_STALLED     0x00000020  // Endpoint Stalled.
#define USB_TXCSRL6_STALL       0x00000010  // Send Stall.
#define USB_TXCSRL6_SETUP       0x00000010  // Setup Packet.
#define USB_TXCSRL6_FLUSH       0x00000008  // Flush FIFO.
#define USB_TXCSRL6_ERROR       0x00000004  // Error.
#define USB_TXCSRL6_UNDRN       0x00000004  // Underrun.
#define USB_TXCSRL6_FIFONE      0x00000002  // FIFO Not Empty.
#define USB_TXCSRL6_TXRDY       0x00000001  // Transmit Packet Ready.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH6 register.
//
//*****************************************************************************
#define USB_TXCSRH6_AUTOSET     0x00000080  // Auto Set.
#define USB_TXCSRH6_ISO         0x00000040  // ISO.
#define USB_TXCSRH6_MODE        0x00000020  // Mode.
#define USB_TXCSRH6_DMAEN       0x00000010  // DMA Request Enable.
#define USB_TXCSRH6_FDT         0x00000008  // Force Data Toggle.
#define USB_TXCSRH6_DMAMOD      0x00000004  // DMA Request Mode.
#define USB_TXCSRH6_DTWE        0x00000002  // Data Toggle Write Enable.
#define USB_TXCSRH6_DT          0x00000001  // Data Toggle.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP6 register.
//
//*****************************************************************************
#define USB_RXMAXP6_MAXLOAD_M   0x000007FF  // Maximum Payload.
#define USB_RXMAXP6_MAXLOAD_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL6 register.
//
//*****************************************************************************
#define USB_RXCSRL6_CLRDT       0x00000080  // Clear Data Toggle.
#define USB_RXCSRL6_STALLED     0x00000040  // Endpoint Stalled.
#define USB_RXCSRL6_REQPKT      0x00000020  // Request Packet.
#define USB_RXCSRL6_STALL       0x00000020  // Send Stall.
#define USB_RXCSRL6_FLUSH       0x00000010  // Flush FIFO.
#define USB_RXCSRL6_NAKTO       0x00000008  // NAK Timeout.
#define USB_RXCSRL6_DATAERR     0x00000008  // Data Error.
#define USB_RXCSRL6_ERROR       0x00000004  // Error.
#define USB_RXCSRL6_OVER        0x00000004  // Overrun.
#define USB_RXCSRL6_FULL        0x00000002  // FIFO Full.
#define USB_RXCSRL6_RXRDY       0x00000001  // Receive Packet Ready.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH6 register.
//
//*****************************************************************************
#define USB_RXCSRH6_AUTOCL      0x00000080  // Auto Clear.
#define USB_RXCSRH6_AUTORQ      0x00000040  // Auto Request.
#define USB_RXCSRH6_ISO         0x00000040  // ISO.
#define USB_RXCSRH6_DMAEN       0x00000020  // DMA Request Enable.
#define USB_RXCSRH6_DISNYET     0x00000010  // Disable NYET
#define USB_RXCSRH6_PIDERR      0x00000010  // PID Error.
#define USB_RXCSRH6_DMAMOD      0x00000008  // DMA Request Mode.
#define USB_RXCSRH6_DTWE        0x00000004  // Data Toggle Write Enable.
#define USB_RXCSRH6_DT          0x00000002  // Data Toggle.
#define USB_RXCSRH6_INCRX       0x00000001  // Incomplete Receive.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT6 register.
//
//*****************************************************************************
#define USB_RXCOUNT6_COUNT_M    0x00001FFF  // Receive Packet Count.
#define USB_RXCOUNT6_COUNT_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE6 register.
//
//*****************************************************************************
#define USB_TXTYPE6_SPEED_M     0x000000C0  // Operating Speed.
#define USB_TXTYPE6_SPEED_DFLT  0x00000000  // Default
#define USB_TXTYPE6_SPEED_FULL  0x00000080  // Full
#define USB_TXTYPE6_SPEED_LOW   0x000000C0  // Low
#define USB_TXTYPE6_PROTO_M     0x00000030  // Protocol.
#define USB_TXTYPE6_PROTO_CTRL  0x00000000  // Control
#define USB_TXTYPE6_PROTO_ISOC  0x00000010  // Isochronous
#define USB_TXTYPE6_PROTO_BULK  0x00000020  // Bulk
#define USB_TXTYPE6_PROTO_INT   0x00000030  // Interrupt
#define USB_TXTYPE6_TEP_M       0x0000000F  // Target Endpoint Number.
#define USB_TXTYPE6_TEP_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL6
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL6_TXPOLL_M \
                                0x000000FF  // TX Polling
#define USB_TXINTERVAL6_NAKLMT_M \
                                0x000000FF  // NAK Limit.
#define USB_TXINTERVAL6_TXPOLL_S \
                                0
#define USB_TXINTERVAL6_NAKLMT_S \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE6 register.
//
//*****************************************************************************
#define USB_RXTYPE6_SPEED_M     0x000000C0  // Operating Speed.
#define USB_RXTYPE6_SPEED_DFLT  0x00000000  // Default
#define USB_RXTYPE6_SPEED_FULL  0x00000080  // Full
#define USB_RXTYPE6_SPEED_LOW   0x000000C0  // Low
#define USB_RXTYPE6_PROTO_M     0x00000030  // Protocol.
#define USB_RXTYPE6_PROTO_CTRL  0x00000000  // Control
#define USB_RXTYPE6_PROTO_ISOC  0x00000010  // Isochronous
#define USB_RXTYPE6_PROTO_BULK  0x00000020  // Bulk
#define USB_RXTYPE6_PROTO_INT   0x00000030  // Interrupt
#define USB_RXTYPE6_TEP_M       0x0000000F  // Target Endpoint Number.
#define USB_RXTYPE6_TEP_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL6
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL6_TXPOLL_M \
                                0x000000FF  // RX Polling
#define USB_RXINTERVAL6_NAKLMT_M \
                                0x000000FF  // NAK Limit.
#define USB_RXINTERVAL6_NAKLMT_S \
                                0
#define USB_RXINTERVAL6_TXPOLL_S \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP7 register.
//
//*****************************************************************************
#define USB_TXMAXP7_MAXLOAD_M   0x000007FF  // Maximum Payload.
#define USB_TXMAXP7_MAXLOAD_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL7 register.
//
//*****************************************************************************
#define USB_TXCSRL7_INCTX       0x00000080  // Incomplete Transmit.
#define USB_TXCSRL7_NAKTO       0x00000080  // NAK Timeout
#define USB_TXCSRL7_CLRDT       0x00000040  // Clear Data Toggle.
#define USB_TXCSRL7_STALLED     0x00000020  // Endpoint Stalled.
#define USB_TXCSRL7_STALL       0x00000010  // Send Stall.
#define USB_TXCSRL7_SETUP       0x00000010  // Setup Packet.
#define USB_TXCSRL7_FLUSH       0x00000008  // Flush FIFO.
#define USB_TXCSRL7_ERROR       0x00000004  // Error.
#define USB_TXCSRL7_UNDRN       0x00000004  // Underrun.
#define USB_TXCSRL7_FIFONE      0x00000002  // FIFO Not Empty.
#define USB_TXCSRL7_TXRDY       0x00000001  // Transmit Packet Ready.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH7 register.
//
//*****************************************************************************
#define USB_TXCSRH7_AUTOSET     0x00000080  // Auto Set.
#define USB_TXCSRH7_ISO         0x00000040  // ISO.
#define USB_TXCSRH7_MODE        0x00000020  // Mode.
#define USB_TXCSRH7_DMAEN       0x00000010  // DMA Request Enable.
#define USB_TXCSRH7_FDT         0x00000008  // Force Data Toggle.
#define USB_TXCSRH7_DMAMOD      0x00000004  // DMA Request Mode.
#define USB_TXCSRH7_DTWE        0x00000002  // Data Toggle Write Enable.
#define USB_TXCSRH7_DT          0x00000001  // Data Toggle.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP7 register.
//
//*****************************************************************************
#define USB_RXMAXP7_MAXLOAD_M   0x000007FF  // Maximum Payload.
#define USB_RXMAXP7_MAXLOAD_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL7 register.
//
//*****************************************************************************
#define USB_RXCSRL7_CLRDT       0x00000080  // Clear Data Toggle.
#define USB_RXCSRL7_STALLED     0x00000040  // Endpoint Stalled.
#define USB_RXCSRL7_REQPKT      0x00000020  // Request Packet.
#define USB_RXCSRL7_STALL       0x00000020  // Send Stall.
#define USB_RXCSRL7_FLUSH       0x00000010  // Flush FIFO.
#define USB_RXCSRL7_DATAERR     0x00000008  // Data Error.
#define USB_RXCSRL7_NAKTO       0x00000008  // NAK Timeout.
#define USB_RXCSRL7_ERROR       0x00000004  // Error.
#define USB_RXCSRL7_OVER        0x00000004  // Overrun.
#define USB_RXCSRL7_FULL        0x00000002  // FIFO Full.
#define USB_RXCSRL7_RXRDY       0x00000001  // Receive Packet Ready.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH7 register.
//
//*****************************************************************************
#define USB_RXCSRH7_AUTOCL      0x00000080  // Auto Clear.
#define USB_RXCSRH7_ISO         0x00000040  // ISO.
#define USB_RXCSRH7_AUTORQ      0x00000040  // Auto Request.
#define USB_RXCSRH7_DMAEN       0x00000020  // DMA Request Enable.
#define USB_RXCSRH7_PIDERR      0x00000010  // PID Error.
#define USB_RXCSRH7_DISNYET     0x00000010  // Disable NYET
#define USB_RXCSRH7_DMAMOD      0x00000008  // DMA Request Mode.
#define USB_RXCSRH7_DTWE        0x00000004  // Data Toggle Write Enable.
#define USB_RXCSRH7_DT          0x00000002  // Data Toggle.
#define USB_RXCSRH7_INCRX       0x00000001  // Incomplete Receive.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT7 register.
//
//*****************************************************************************
#define USB_RXCOUNT7_COUNT_M    0x00001FFF  // Receive Packet Count.
#define USB_RXCOUNT7_COUNT_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE7 register.
//
//*****************************************************************************
#define USB_TXTYPE7_SPEED_M     0x000000C0  // Operating Speed.
#define USB_TXTYPE7_SPEED_DFLT  0x00000000  // Default
#define USB_TXTYPE7_SPEED_FULL  0x00000080  // Full
#define USB_TXTYPE7_SPEED_LOW   0x000000C0  // Low
#define USB_TXTYPE7_PROTO_M     0x00000030  // Protocol.
#define USB_TXTYPE7_PROTO_CTRL  0x00000000  // Control
#define USB_TXTYPE7_PROTO_ISOC  0x00000010  // Isochronous
#define USB_TXTYPE7_PROTO_BULK  0x00000020  // Bulk
#define USB_TXTYPE7_PROTO_INT   0x00000030  // Interrupt
#define USB_TXTYPE7_TEP_M       0x0000000F  // Target Endpoint Number.
#define USB_TXTYPE7_TEP_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL7
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL7_TXPOLL_M \
                                0x000000FF  // TX Polling
#define USB_TXINTERVAL7_NAKLMT_M \
                                0x000000FF  // NAK Limit.
#define USB_TXINTERVAL7_NAKLMT_S \
                                0
#define USB_TXINTERVAL7_TXPOLL_S \
                                0

